SOAPtoREST/map.json

{"Mappings":[{"Name":"GetWeatherInformation","Method":"GET","RouteTemplate":"GetWeatherInformation","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body></soap:Body></soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetWeatherInformation","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"},{"Name":"GetCityForecastByZIP","Method":"GET","RouteTemplate":"GetCityForecastByZIP/{ZIP}","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetCityForecastByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\"><ZIP>{ZIP}</ZIP></GetCityForecastByZIP></soap:Body></soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetCityForecastByZIP","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"},{"Name":"GetCityWeatherByZIP","Method":"GET","RouteTemplate":"GetCityWeatherByZIP/{ZIP}","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetCityWeatherByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\"><ZIP>{ZIP}</ZIP></GetCityWeatherByZIP></soap:Body></soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetCityWeatherByZIP","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"}]}